Oryx-Embedded/CycloneTCP/drivers/mac/mcxn947_eth_driver.c
   //Disable MAC interrupts
   ENET->MAC_INTERRUPT_ENABLE = 0;

   //Enable the desired DMA interrupts
   ENET->DMA_CH[0].DMA_CHX_INT_EN = ENET_DMA_CH_DMA_CHX_INT_EN_NIE_MASK |
      ENET_DMA_CH_DMA_CHX_INT_EN_RIE_MASK | ENET_DMA_CH_DMA_CHX_INT_EN_TIE_MASK;

   //Set priority grouping (3 bits for pre-emption priority, no bits for subpriority)
   NVIC_SetPriorityGrouping(MCXN947_ETH_IRQ_PRIORITY_GROUPING);

   //Configure Ethernet interrupt priority
   NVIC_SetPriority(ETHERNET_IRQn, NVIC_EncodePriority(MCXN947_ETH_IRQ_PRIORITY_GROUPING,
      MCXN947_ETH_IRQ_GROUP_PRIORITY, MCXN947_ETH_IRQ_SUB_PRIORITY));

   //Enable MAC transmission and reception
   ENET->MAC_CONFIGURATION |= ENET_MAC_CONFIGURATION_TE_MASK |
      ENET_MAC_CONFIGURATION_RE_MASK;

   //Enable DMA transmission and reception
   ENET->DMA_CH[0].DMA_CHX_TX_CTRL |= ENET_DMA_CH_DMA_CHX_TX_CTRL_ST_MASK;
   ENET->DMA_CH[0].DMA_CHX_RX_CTRL |= ENET_DMA_CH_DMA_CHX_RX_CTRL_SR_MASK;

   //Accept any packets from the upper layer
   osSetEvent(&interface->nicTxEvent);

   //Successful initialization
   return NO_ERROR;
}


/**
 * @brief GPIO configuration
 * @param[in] interface Underlying network interface
 **/

__weak_func void mcxn947EthInitGpio(NetInterface *interface)
{
//FRDM-MCXN947 evaluation board?
#if defined(USE_FRDM_MCXN947)
   port_pin_config_t portPinConfig;
   gpio_pin_config_t gpioPinConfig;

   //Enable PORT1 clock
   CLOCK_EnableClock(kCLOCK_Port1);

   //Select RMII interface mode
   SYSCON0->ENET_PHY_INTF_SEL |= SYSCON_ENET_PHY_INTF_SEL_PHY_SEL_MASK;

   //Configure RMII pins
   portPinConfig.pullSelect = kPORT_PullDisable;
   portPinConfig.pullValueSelect = kPORT_LowPullResistor;
   portPinConfig.slewRate = kPORT_FastSlewRate;
   portPinConfig.passiveFilterEnable = kPORT_PassiveFilterDisable;
   portPinConfig.openDrainEnable = kPORT_OpenDrainDisable;
   portPinConfig.driveStrength = kPORT_LowDriveStrength;
   portPinConfig.mux = kPORT_MuxAlt9;
   portPinConfig.inputBuffer = kPORT_InputBufferEnable;
   portPinConfig.invertInput = kPORT_InputNormal;
   portPinConfig.lockRegister = kPORT_UnlockRegister;

   //Configure ENET0_TX_CLK (P1_4)
   PORT_SetPinConfig(PORT1, 4, &portPinConfig);
   //Configure ENET0_TXEN (P1_5)
   PORT_SetPinConfig(PORT1, 5, &portPinConfig);
   //Configure ENET0_TXD0 (P1_6)
   PORT_SetPinConfig(PORT1, 6, &portPinConfig);
   //Configure ENET0_TXD1 (P1_7)
   PORT_SetPinConfig(PORT1, 7, &portPinConfig);

   //Configure ENET0_RXDV (P1_13)
   PORT_SetPinConfig(PORT1, 13, &portPinConfig);
   //Configure ENET0_RXD0 (P1_14)
   PORT_SetPinConfig(PORT1, 14, &portPinConfig);
   //Configure ENET0_RXD1 (P1_15)
   PORT_SetPinConfig(PORT1, 15, &portPinConfig);

   //Configure ENET0_MDC (P1_20)
   PORT_SetPinConfig(PORT1, 20, &portPinConfig);
   //Configure ENET0_MDIO (P1_21)
   PORT_SetPinConfig(PORT1, 21, &portPinConfig);

   //Configure ENET_RST (P5_8) as an output
   gpioPinConfig.pinDirection = kGPIO_DigitalOutput;
   gpioPinConfig.outputLogic = 0;
   GPIO_PinInit(GPIO5, 8, &gpioPinConfig);

   //Reset PHY transceiver (hard reset)
   GPIO_PinWrite(GPIO5, 8, 0);
   sleep(10);
   GPIO_PinWrite(GPIO5, 8, 1);
   sleep(10);

//MCX-N9XX-EVK evaluation board?
#elif defined(USE_MCX_N9XX_EVK)
   port_pin_config_t portPinConfig;

   //Enable PORT1 clock
   CLOCK_EnableClock(kCLOCK_Port1);

   //Select RMII interface mode
   SYSCON0->ENET_PHY_INTF_SEL |= SYSCON_ENET_PHY_INTF_SEL_PHY_SEL_MASK;

   //Configure RMII pins
   portPinConfig.pullSelect = kPORT_PullDisable;
   portPinConfig.pullValueSelect = kPORT_LowPullResistor;
   portPinConfig.slewRate = kPORT_FastSlewRate;
   portPinConfig.passiveFilterEnable = kPORT_PassiveFilterDisable;
   portPinConfig.openDrainEnable = kPORT_OpenDrainDisable;
   portPinConfig.driveStrength = kPORT_LowDriveStrength;
   portPinConfig.mux = kPORT_MuxAlt9;
   portPinConfig.inputBuffer = kPORT_InputBufferEnable;
   portPinConfig.invertInput = kPORT_InputNormal;
   portPinConfig.lockRegister = kPORT_UnlockRegister;

   //Configure ENET0_TX_CLK (P1_4)
   PORT_SetPinConfig(PORT1, 4, &portPinConfig);
   //Configure ENET0_TXEN (P1_5)
   PORT_SetPinConfig(PORT1, 5, &portPinConfig);
   //Configure ENET0_TXD0 (P1_6)
   PORT_SetPinConfig(PORT1, 6, &portPinConfig);
   //Configure ENET0_TXD1 (P1_7)
   PORT_SetPinConfig(PORT1, 7, &portPinConfig);

   //Configure ENET0_RXDV (P1_13)
   PORT_SetPinConfig(PORT1, 13, &portPinConfig);
   //Configure ENET0_RXD0 (P1_14)
   PORT_SetPinConfig(PORT1, 14, &portPinConfig);
   //Configure ENET0_RXD1 (P1_15)
   PORT_SetPinConfig(PORT1, 15, &portPinConfig);

   //Configure ENET0_MDC (P1_20)
   PORT_SetPinConfig(PORT1, 20, &portPinConfig);
   //Configure ENET0_MDIO (P1_21)
   PORT_SetPinConfig(PORT1, 21, &portPinConfig);
#endif
}


/**
 * @brief Initialize DMA descriptor lists
 * @param[in] interface Underlying network interface
 **/

void mcxn947EthInitDmaDesc(NetInterface *interface)
{
   uint_t i;

   //Initialize TX DMA descriptor list
   for(i = 0; i < MCXN947_ETH_TX_BUFFER_COUNT; i++)
   {
      //The descriptor is initially owned by the application
      txDmaDesc[i].tdes0 = 0;
      txDmaDesc[i].tdes1 = 0;
      txDmaDesc[i].tdes2 = 0;
      txDmaDesc[i].tdes3 = 0;
   }

   //Initialize TX descriptor index
   txIndex = 0;

   //Initialize RX DMA descriptor list
   for(i = 0; i < MCXN947_ETH_RX_BUFFER_COUNT; i++)
   {
      //The descriptor is initially owned by the DMA
      rxDmaDesc[i].rdes0 = (uint32_t) rxBuffer[i];
      rxDmaDesc[i].rdes1 = 0;
      rxDmaDesc[i].rdes2 = 0;
      rxDmaDesc[i].rdes3 = ENET_RDES3_OWN | ENET_RDES3_IOC | ENET_RDES3_BUF1V;
   }

   //Initialize RX descriptor index
   rxIndex = 0;

   //Start location of the TX descriptor list
   ENET->DMA_CH[0].DMA_CHX_TXDESC_LIST_ADDR = (uint32_t) &txDmaDesc[0];
   //Length of the transmit descriptor ring
   ENET->DMA_CH[0].DMA_CHX_TXDESC_RING_LENGTH = MCXN947_ETH_TX_BUFFER_COUNT - 1;

   //Start location of the RX descriptor list
   ENET->DMA_CH[0].DMA_CHX_RXDESC_LIST_ADDR = (uint32_t) &rxDmaDesc[0];
   //Length of the receive descriptor ring
   ENET->DMA_CH[0].DMA_CHX_RX_CONTROL2 = MCXN947_ETH_RX_BUFFER_COUNT - 1;
}


/**
 * @brief MCX N947 Ethernet MAC timer handler
 *
 * This routine is periodically called by the TCP/IP stack to handle periodic
 * operations such as polling the link state
 *
 * @param[in] interface Underlying network interface
 **/

void mcxn947EthTick(NetInterface *interface)
{
   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Handle periodic operations
      interface->phyDriver->tick(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Handle periodic operations
      interface->switchDriver->tick(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief Enable interrupts
 * @param[in] interface Underlying network interface
 **/

void mcxn947EthEnableIrq(NetInterface *interface)
{
   //Enable Ethernet MAC interrupts
   NVIC_EnableIRQ(ETHERNET_IRQn);

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Enable Ethernet PHY interrupts
      interface->phyDriver->enableIrq(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Enable Ethernet switch interrupts
      interface->switchDriver->enableIrq(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief Disable interrupts
 * @param[in] interface Underlying network interface
 **/

void mcxn947EthDisableIrq(NetInterface *interface)
{
   //Disable Ethernet MAC interrupts
   NVIC_DisableIRQ(ETHERNET_IRQn);

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Disable Ethernet PHY interrupts
      interface->phyDriver->disableIrq(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Disable Ethernet switch interrupts
      interface->switchDriver->disableIrq(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief MCX N947 Ethernet MAC interrupt service routine
 **/

void ETHERNET_IRQHandler(void)
{
   bool_t flag;
   uint32_t status;

   //Interrupt service routine prologue
   osEnterIsr();

   //This flag will be set if a higher priority task must be woken
   flag = FALSE;

   //Read DMA status register
   status = ENET->DMA_CH[0].DMA_CHX_STAT;

   //Packet transmitted?
   if((status & ENET_DMA_CH_DMA_CHX_STAT_TI_MASK) != 0)
   {
      //Clear TI interrupt flag
      ENET->DMA_CH[0].DMA_CHX_STAT = ENET_DMA_CH_DMA_CHX_STAT_TI_MASK;

